/* ========================================================================= */
#include <SoftwareSerial.h>
#include "gsm.h"
/* ========================================================================= */
SoftwareGSM *gsm;
String buf;
int temp = 0;
/* ========================================================================= */
void setup()
{
	Serial.begin(DEFAULT_SERIAL_PORT);  // Скорость порта для связи Arduino с компьютером
	gsm = new SoftwareGSM();
	digitalWrite(DEFUALT_POWER_PIN, HIGH);
	Serial.println("[GSM] module started.");
}
/* ========================================================================= */
void loop() 
{
	gsm->execute();
}
/* ========================================================================= */