/* ========================================================================= */
#include "gsm.h"
/* ========================================================================= */
SoftwareGSM* gsm;
/* ========================================================================= */
void setup() {
	Serial.begin(DEFAULT_SERIAL_PORT);  // Скорость порта для связи Arduino с компьютером
	digitalWrite(DEFUALT_POWER_PIN, HIGH);
	gsm = new SoftwareGSM();
	Serial.println(F("[GSM] module started."));
	viewFreeMemory();
}
/* ========================================================================= */
void loop() {
	gsm->execute();
}
/* ========================================================================= */
